apache/nuttx/arch/arm/src/stm32c5/hardware/stm32c5xx_pinmap.h
#define GPIO_I2C1_SCL_1              (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_I2C1_SCL_2              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_I2C1_SCL_3              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_I2C1_SCL_4              (GPIO_ALT | GPIO_AF4 | GPIO_PORTH | GPIO_PIN1)
#define GPIO_I2C1_SDA_1              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_I2C1_SDA_2              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_I2C1_SDA_3              (GPIO_ALT | GPIO_AF9 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_I2C1_SDA_4              (GPIO_ALT | GPIO_AF4 | GPIO_PORTH | GPIO_PIN0)
#define GPIO_I2C1_SMBA_1             (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_I2C1_SMBA_2             (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_I2C2_SCL_1              (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_I2C2_SCL_2              (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_I2C2_SCL_3              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_I2C2_SDA_1              (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_I2C2_SDA_2              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_I2C2_SDA_3              (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_I2C2_SDA_4              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_I2C2_SMBA_1             (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_I2C2_SMBA_2             (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN13)

/* Inter-IC sound interfaces */

#define GPIO_I2S1_CK_1               (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_I2S1_CK_2               (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_I2S1_MCK_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN4)
#define GPIO_I2S1_SDI_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_I2S1_SDI_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_I2S1_SDO_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_I2S1_SDO_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_I2S1_SDO_3              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_I2S1_WS_1               (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_I2S1_WS_2               (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_I2S2_CK_1               (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_I2S2_CK_2               (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_I2S2_CK_3               (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_I2S2_CK_4               (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_I2S2_CK_5               (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_I2S2_CK_6               (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_I2S2_MCK_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_I2S2_SDI_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_I2S2_SDI_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_I2S2_SDI_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN2)
#define GPIO_I2S2_SDO_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_I2S2_SDO_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_I2S2_SDO_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_I2S2_SDO_4              (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_I2S2_WS_1               (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_I2S2_WS_2               (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_I2S2_WS_3               (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_I2S2_WS_4               (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_I2S2_WS_5               (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_I2S2_WS_6               (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_I2S2_WS_7               (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_I2S3_CK_1               (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_I2S3_CK_2               (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_I2S3_CK_3               (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_I2S3_CK_4               (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_I2S3_CK_5               (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_I2S3_CK_6               (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_I2S3_MCK_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_I2S3_SDI_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_I2S3_SDI_2              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_I2S3_SDI_3              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_I2S3_SDI_4              (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_I2S3_SDO_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_I2S3_SDO_2              (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_I2S3_SDO_3              (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_I2S3_SDO_4              (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_I2S3_SDO_5              (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_I2S3_SDO_6              (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_I2S3_WS_1               (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_I2S3_WS_2               (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_I2S3_WS_3               (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN8)

/* Improved inter-integrated circuit interfaces */

#define GPIO_I3C1_SCL_1              (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_I3C1_SCL_2              (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_I3C1_SCL_3              (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_I3C1_SCL_4              (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_I3C1_SCL_5              (GPIO_ALT | GPIO_AF4 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_I3C1_SDA_1              (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_I3C1_SDA_2              (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_I3C1_SDA_3              (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_I3C1_SDA_4              (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_I3C1_SDA_5              (GPIO_ALT | GPIO_AF4 | GPIO_PORTC | GPIO_PIN11)

