apache/nuttx/arch/arm/src/stm32c5/hardware/stm32c5xx_pinmap.h
/* Low-power timers */

#define GPIO_LPTIM1_CH1_1            (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_LPTIM1_CH1_2            (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_LPTIM1_CH2_1            (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_LPTIM1_ETR_1            (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_LPTIM1_IN1_1            (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_LPTIM1_IN1_2            (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_LPTIM1_IN2_1            (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_LPTIM1_IN2_2            (GPIO_ALT | GPIO_AF1 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_LPTIM1_IN2_3            (GPIO_ALT | GPIO_AF3 | GPIO_PORTH | GPIO_PIN2)

/* Low-power UART */

#define GPIO_LPUART1_CTS_1           (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_LPUART1_CTS_2           (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_LPUART1_CTS_3           (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_LPUART1_RTS_DE_1        (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_LPUART1_RTS_DE_2        (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_LPUART1_RTS_DE_3        (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_LPUART1_RX_1            (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_LPUART1_RX_2            (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_LPUART1_RX_3            (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_LPUART1_RX_4            (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_LPUART1_TX_1            (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_LPUART1_TX_2            (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_LPUART1_TX_3            (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_LPUART1_TX_4            (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_LPUART1_TX_5            (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN3)

/* Clock outputs */

#define GPIO_LSCO_1                  (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN2)
#define GPIO_MCO1_1                  (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_MCO1_2                  (GPIO_ALT | GPIO_AF0 | GPIO_PORTH | GPIO_PIN2)
#define GPIO_MCO2_1                  (GPIO_ALT | GPIO_AF0 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_MCO2_2                  (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN9)

/* Power control */

#define GPIO_CSLEEP_1                (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN2)
#define GPIO_CSTOP_1                 (GPIO_ALT | GPIO_AF0 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_PVD_IN_1                (GPIO_ANALOG | GPIO_PORTB | GPIO_PIN15)

/* Real-time clock */

#define GPIO_RTC_OUT2_1              (GPIO_ALT | GPIO_AF0 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_RTC_REFIN_1             (GPIO_ALT | GPIO_AF0 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_RTC_TS_1                (GPIO_ANALOG | GPIO_PORTC | GPIO_PIN13)

/* Serial peripheral interfaces */

#define GPIO_SPI1_MISO_1             (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_SPI1_MISO_2             (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_SPI1_MOSI_1             (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_SPI1_MOSI_2             (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_SPI1_MOSI_3             (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_SPI1_NSS_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_SPI1_NSS_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_SPI1_RDY_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_SPI1_RDY_2              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_SPI1_SCK_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_SPI1_SCK_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_SPI2_MISO_1             (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_SPI2_MISO_2             (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_SPI2_MISO_3             (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN2)
#define GPIO_SPI2_MOSI_1             (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_SPI2_MOSI_2             (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_SPI2_MOSI_3             (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN1)
#define GPIO_SPI2_MOSI_4             (GPIO_ALT | GPIO_AF5 | GPIO_PORTC | GPIO_PIN3)
#define GPIO_SPI2_NSS_1              (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_SPI2_NSS_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_SPI2_NSS_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_SPI2_NSS_4              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_SPI2_NSS_5              (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_SPI2_NSS_6              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_SPI2_NSS_7              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_SPI2_RDY_1              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_SPI2_RDY_2              (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_SPI2_SCK_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_SPI2_SCK_2              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_SPI2_SCK_3              (GPIO_ALT | GPIO_AF5 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_SPI2_SCK_4              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_SPI2_SCK_5              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_SPI2_SCK_6              (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_SPI3_MISO_1             (GPIO_ALT | GPIO_AF5 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_SPI3_MISO_2             (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_SPI3_MISO_3             (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_SPI3_MISO_4             (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_SPI3_MOSI_1             (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_SPI3_MOSI_2             (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_SPI3_MOSI_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN2)
#define GPIO_SPI3_MOSI_4             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_SPI3_MOSI_5             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_SPI3_MOSI_6             (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_SPI3_NSS_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_SPI3_NSS_2              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_SPI3_NSS_3              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_SPI3_RDY_1              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_SPI3_SCK_1              (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_SPI3_SCK_2              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_SPI3_SCK_3              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_SPI3_SCK_4              (GPIO_ALT | GPIO_AF6 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_SPI3_SCK_5              (GPIO_ALT | GPIO_AF6 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_SPI3_SCK_6              (GPIO_ALT | GPIO_AF5 | GPIO_PORTE | GPIO_PIN2)

/* Timers */

#define GPIO_TIM1_BKIN_1             (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM1_BKIN_2             (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_TIM1_CH1IN_1            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM1_CH1NOUT_1          (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM1_CH1NOUT_2          (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN13)
#define GPIO_TIM1_CH1OUT_1           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM1_CH2IN_1            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN9)
#define GPIO_TIM1_CH2NOUT_1          (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN15)
#define GPIO_TIM1_CH2NOUT_2          (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN0)
#define GPIO_TIM1_CH2NOUT_3          (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TIM1_CH2OUT_1           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN9)
#define GPIO_TIM1_CH3IN_1            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN5)
#define GPIO_TIM1_CH3IN_2            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN10)
#define GPIO_TIM1_CH3NOUT_1          (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TIM1_CH3NOUT_2          (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN15)
#define GPIO_TIM1_CH3OUT_1           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN5)
#define GPIO_TIM1_CH3OUT_2           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN10)
#define GPIO_TIM1_CH4IN_1            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN11)
#define GPIO_TIM1_CH4NOUT_1          (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN5)
#define GPIO_TIM1_CH4OUT_1           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN11)
#define GPIO_TIM1_ETR_1              (GPIO_ALT | GPIO_AF1 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_TIM2_CH1IN_1            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM2_CH1IN_2            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN5)
#define GPIO_TIM2_CH1IN_3            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN15)
#define GPIO_TIM2_CH1OUT_1           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM2_CH1OUT_2           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN5)
#define GPIO_TIM2_CH1OUT_3           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN15)
#define GPIO_TIM2_CH2IN_1            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM2_CH2IN_2            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TIM2_CH2OUT_1           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM2_CH2OUT_2           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TIM2_CH3IN_1            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM2_CH3IN_2            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN10)
#define GPIO_TIM2_CH3OUT_1           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM2_CH3OUT_2           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN10)
#define GPIO_TIM2_CH4IN_1            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM2_CH4IN_2            (GPIO_ALT | GPIO_AF14 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM2_CH4IN_3            (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN4)
#define GPIO_TIM2_CH4OUT_1           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM2_CH4OUT_2           (GPIO_ALT | GPIO_AF14 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM2_CH4OUT_3           (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN4)
#define GPIO_TIM2_ETR_1              (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM2_ETR_2              (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_TIM2_ETR_3              (GPIO_ALT | GPIO_AF14 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_TIM5_CH1IN_1            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM5_CH1IN_2            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM5_CH1IN_3            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TIM5_CH1IN_4            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TIM5_CH1OUT_1           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM5_CH1OUT_2           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM5_CH1OUT_3           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TIM5_CH1OUT_4           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TIM5_CH2IN_1            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM5_CH2IN_2            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM5_CH2IN_3            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM5_CH2IN_4            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN7)
#define GPIO_TIM5_CH2OUT_1           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM5_CH2OUT_2           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM5_CH2OUT_3           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM5_CH2OUT_4           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN7)
#define GPIO_TIM5_CH3IN_1            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM5_CH3IN_2            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN0)
#define GPIO_TIM5_CH3IN_3            (GPIO_ALT | GPIO_AF3 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TIM5_CH3IN_4            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN8)
#define GPIO_TIM5_CH3OUT_1           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM5_CH3OUT_2           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN0)
#define GPIO_TIM5_CH3OUT_3           (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TIM5_CH3OUT_4           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN8)
#define GPIO_TIM5_CH4IN_1            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM5_CH4IN_2            (GPIO_ALT | GPIO_AF8 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM5_CH4IN_3            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TIM5_CH4IN_4            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN9)
#define GPIO_TIM5_CH4OUT_1           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM5_CH4OUT_2           (GPIO_ALT | GPIO_AF8 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM5_CH4OUT_3           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TIM5_CH4OUT_4           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN9)
#define GPIO_TIM5_ETR_1              (GPIO_ALT | GPIO_AF2 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_TIM5_ETR_2              (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_TIM8_BKIN_1             (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM8_BKIN_2             (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM8_BKIN_3             (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN4)
#define GPIO_TIM8_BKIN2_1            (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM8_BKIN2_2            (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN5)
#define GPIO_TIM8_CH1IN_1            (GPIO_ALT | GPIO_AF13 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TIM8_CH1IN_2            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN10)
#define GPIO_TIM8_CH1IN_3            (GPIO_ALT | GPIO_AF3 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TIM8_CH1NOUT_1          (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN5)
#define GPIO_TIM8_CH1NOUT_2          (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM8_CH1NOUT_3          (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN10)
#define GPIO_TIM8_CH1OUT_1           (GPIO_ALT | GPIO_AF13 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TIM8_CH1OUT_2           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN10)
#define GPIO_TIM8_CH1OUT_3           (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TIM8_CH2IN_1            (GPIO_ALT | GPIO_AF13 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TIM8_CH2IN_2            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN13)
#define GPIO_TIM8_CH2IN_3            (GPIO_ALT | GPIO_AF3 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN7)
#define GPIO_TIM8_CH2NOUT_1          (GPIO_ALT | GPIO_AF13 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN9)
#define GPIO_TIM8_CH2NOUT_2          (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN0)
#define GPIO_TIM8_CH2NOUT_3          (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TIM8_CH2NOUT_4          (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN11)
#define GPIO_TIM8_CH2OUT_1           (GPIO_ALT | GPIO_AF13 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TIM8_CH2OUT_2           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN13)
#define GPIO_TIM8_CH2OUT_3           (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN7)
#define GPIO_TIM8_CH3IN_1            (GPIO_ALT | GPIO_AF13 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM8_CH3IN_2            (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN12)
#define GPIO_TIM8_CH3IN_3            (GPIO_ALT | GPIO_AF3 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN8)
#define GPIO_TIM8_CH3NOUT_1          (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TIM8_CH3NOUT_2          (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN15)
#define GPIO_TIM8_CH3NOUT_3          (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN12)
#define GPIO_TIM8_CH3OUT_1           (GPIO_ALT | GPIO_AF13 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM8_CH3OUT_2           (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN12)
#define GPIO_TIM8_CH3OUT_3           (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN8)
#define GPIO_TIM8_CH4IN_1            (GPIO_ALT | GPIO_AF13 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TIM8_CH4IN_2            (GPIO_ALT | GPIO_AF3 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN9)
#define GPIO_TIM8_CH4NOUT_1          (GPIO_ALT | GPIO_AF13 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN15)
#define GPIO_TIM8_CH4NOUT_2          (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN2)
#define GPIO_TIM8_CH4OUT_1           (GPIO_ALT | GPIO_AF13 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TIM8_CH4OUT_2           (GPIO_ALT | GPIO_AF3 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN9)
#define GPIO_TIM8_ETR_1              (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM12_CH1IN_1           (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TIM12_CH1IN_2           (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN14)
#define GPIO_TIM12_CH1OUT_1          (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TIM12_CH1OUT_2          (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN14)
#define GPIO_TIM12_CH2IN_1           (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN15)
#define GPIO_TIM12_CH2IN_2           (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN15)
#define GPIO_TIM12_CH2OUT_1          (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN15)
#define GPIO_TIM12_CH2OUT_2          (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN15)
#define GPIO_TIM15_BKIN_1            (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM15_BKIN_2            (GPIO_ALT | GPIO_AF4 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_TIM15_CH1IN_1           (GPIO_ALT | GPIO_AF4 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM15_CH1IN_2           (GPIO_ALT | GPIO_AF4 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM15_CH1IN_3           (GPIO_ALT | GPIO_AF2 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN12)
#define GPIO_TIM15_CH1NOUT_1         (GPIO_ALT | GPIO_AF4 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN1)
#define GPIO_TIM15_CH1NOUT_2         (GPIO_ALT | GPIO_AF4 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN9)
#define GPIO_TIM15_CH1OUT_1          (GPIO_ALT | GPIO_AF4 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM15_CH1OUT_2          (GPIO_ALT | GPIO_AF4 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM15_CH1OUT_3          (GPIO_ALT | GPIO_AF2 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN12)
#define GPIO_TIM15_CH2IN_1           (GPIO_ALT | GPIO_AF4 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM15_CH2IN_2           (GPIO_ALT | GPIO_AF4 | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM15_CH2OUT_1          (GPIO_ALT | GPIO_AF4 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM15_CH2OUT_2          (GPIO_ALT | GPIO_AF4 | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TIM16_BKIN_1            (GPIO_ALT | GPIO_AF10 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_TIM16_BKIN_2            (GPIO_ALT | GPIO_AF10 | GPIO_PORTC | GPIO_PIN0)
#define GPIO_TIM16_CH1IN_1           (GPIO_ALT | GPIO_AF10 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TIM16_CH1IN_2           (GPIO_ALT | GPIO_AF10 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN4)
#define GPIO_TIM16_CH1NOUT_1         (GPIO_ALT | GPIO_AF10 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN6)
#define GPIO_TIM16_CH1NOUT_2         (GPIO_ALT | GPIO_AF10 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN5)
#define GPIO_TIM16_CH1OUT_1          (GPIO_ALT | GPIO_AF10 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TIM16_CH1OUT_2          (GPIO_ALT | GPIO_AF10 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN4)
#define GPIO_TIM17_BKIN_1            (GPIO_ALT | GPIO_AF1 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TIM17_CH1IN_1           (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TIM17_CH1IN_2           (GPIO_ALT | GPIO_AF1 | GPIO_FLOAT | GPIO_PORTC | GPIO_PIN2)
#define GPIO_TIM17_CH1NOUT_1         (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TIM17_CH1NOUT_2         (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTH | GPIO_PIN2)
#define GPIO_TIM17_CH1OUT_1          (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TIM17_CH1OUT_2          (GPIO_ALT | GPIO_AF1 | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN2)

/* Universal asynchronous receiver/transmitters */

