apache/nuttx/arch/arm/src/stm32c5/hardware/stm32c5xx_pinmap.h
#define GPIO_UART4_CTS_1             (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_UART4_CTS_2             (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_UART4_RTS_DE_1          (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_UART4_RTS_DE_2          (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_UART4_RX_1              (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_UART4_RX_2              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_UART4_RX_3              (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_UART4_RX_4              (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_UART4_TX_1              (GPIO_ALT | GPIO_AF8 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_UART4_TX_2              (GPIO_ALT | GPIO_AF6 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_UART4_TX_3              (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_UART4_TX_4              (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN10)
#define GPIO_UART5_CTS_1             (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_UART5_CTS_2             (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN9)
#define GPIO_UART5_RTS_DE_1          (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_UART5_RTS_DE_2          (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_UART5_RX_1              (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_UART5_RX_2              (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_UART5_RX_3              (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_UART5_RX_4              (GPIO_ALT | GPIO_AF8 | GPIO_PORTD | GPIO_PIN2)
#define GPIO_UART5_TX_1              (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_UART5_TX_2              (GPIO_ALT | GPIO_AF14 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_UART5_TX_3              (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN12)

/* Universal synchronous/asynchronous receiver/transmitters */

#define GPIO_USART1_CK_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_USART1_CTS_1            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_USART1_CTS_2            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_USART1_NSS_1            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_USART1_NSS_2            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_USART1_RTS_DE_1         (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_USART1_RX_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_USART1_RX_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN10)
#define GPIO_USART1_RX_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_USART1_RX_4             (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_USART1_TX_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_USART1_TX_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN9)
#define GPIO_USART1_TX_3             (GPIO_ALT | GPIO_AF11 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_USART1_TX_4             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_USART1_TX_5             (GPIO_ALT | GPIO_AF4 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_USART2_CK_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_USART2_CK_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN15)
#define GPIO_USART2_CTS_1            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_USART2_NSS_1            (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_USART2_RTS_DE_1         (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_USART2_RX_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_USART2_RX_2             (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_USART2_TX_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_USART2_TX_2             (GPIO_ALT | GPIO_AF4 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_USART2_TX_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_USART3_CK_1             (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN5)
#define GPIO_USART3_CK_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_USART3_CK_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_USART3_CTS_1            (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_USART3_CTS_2            (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_USART3_NSS_1            (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN6)
#define GPIO_USART3_NSS_2            (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_USART3_RTS_DE_1         (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN7)
#define GPIO_USART3_RTS_DE_2         (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_USART3_RX_1             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_USART3_RX_2             (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN4)
#define GPIO_USART3_RX_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN4)
#define GPIO_USART3_RX_4             (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN11)
#define GPIO_USART3_TX_1             (GPIO_ALT | GPIO_AF11 | GPIO_PORTB | GPIO_PIN3)
#define GPIO_USART3_TX_2             (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN10)
#define GPIO_USART3_TX_3             (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN10)

/* USB full-speed interface */

#define GPIO_USB_DM_1                (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN11)
#define GPIO_USB_DP_1                (GPIO_ANALOG | GPIO_PORTA | GPIO_PIN12)

#endif /* __ARCH_ARM_SRC_STM32C5_HARDWARE_STM32C5XX_PINMAP_H */
